org/docker-lnmp.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+OPTIONS: author:nil date:nil creator:nil \n:t
#+TITLE: 使用docker搭建板砖环境 (Lnmp)
* 安装
  #+begin_src bash
  sudo pacman -S docker
  #+end_src
** 加入用户组
   #+begin_src bash
   sudo usermod -aG docker $USER
   #+end_src
** 加速源
   编辑 =/etc/docker/daemon.json= 加入
   #+begin_src 
   {
   "registry-mirrors": ["https://docker.mirrors.ustc.edu.cn/"]
   }
   #+end_src
* 拉取镜像
  #+begin_src bash
  docker pull nginx
  docker pull mysql:5.6
  docker pull php:7.4-fpm
  docker pull composer
  docker pull phpmyadmin/phpmyadmin
  #+end_src
* 创建项目
  #+begin_src bash
  mkdir -p ~/webstack/php-develop/nginx/www/
  mkdir -p ~/webstack/php-develop/nginx/conf/conf.d/
  cd ~/webstack/php-develop/nginx/www/
  #+end_src
** 安装tp框架
   #+begin_src bash
   docker run --rm --interactive --tty \
   --volume $PWD:/app \
   composer create-project topthink/think tp6
   #+end_src
* 启动容器
  #+begin_src bash
  docker run --name php-fpm -v ~/webstack/php-develop/nginx/www:/www -d php:7.4-fpm
  docker run --name nginx -p 8082:80 -d \
  -v ~/webstack/php-develop/nginx/www:/usr/share/nginx/html:ro \
  -v ~/webstack/php-develop/nginx/log:/var/log/nginx \
  -v ~/webstack/php-develop/nginx/conf/conf.d:/etc/nginx/conf.d:ro \
  --link php-fpm:php \
  nginx
  docker run --name mysql -p 3306:3306 -e MYSQL_ROOT_PASSWORD=youpasswd -d mysql:5.6
  #+end_src
* phpMyAdmin
  #+begin_src bash
  docker run --name phpmyadmin -p 8083:80 --link mysql:db -d phpmyadmin/phpmyadmin:latest
  #+end_src
* 容器停止后的启动顺序  
  =docker stop phpmyadmin mysql nginx php-fpm=
  =php-fpm= -> =nginx= -> =mysql= -> =phpmyadmin=
* TL;DR
  _极度讨厌Python，所以不会使用docker compose，即使迫不得已也不会让它运行在宿主机_
